IDEA Open Model
CrossSectionFactory Methods
The CrossSectionFactory type exposes the following members.
Methods
Name | Description
FillBox2
 Box 2 - steel shape
FillCircle
 Circular shape - massive concrete shape
FillColdFormedL
 Fill parameters for cold formed L section
FillColdFormedLgen
 Fill parameters for cold formed L - gen section
FillColdFormedOmega
 Fill parameters for cold formed Omega section
FillColdFormedRegularPolygon
 Fill parameters for cold formed Regular polygon section
FillColdFormedRHS
 Fill parameters for cold formed RHS section
FillColdFormedSigma
 Fill parameters for cold formed sigma section
FillColdFormedZ
 Fill parameters for cold formed Z section
FillColdFormedZed
 Fill parameters for cold formed Z-ed section
FillCssIarc
 Fill steel section of parametric I section
FillCssRectangleHollow
 Fill cross-section of shape rectangular for concrete sections
FillCssSteelAngle
 Fill steel section of angle shape
FillCssSteelChannel
 Create steel section Channel shape - steel shape
FillCssSteelRectangularHollow
 Fill cross-section of shape rectangular for steel sections
FillCssTarc
 Creates one item cross-section T - steel shape
FillCHSPar
 Circular hollow section - steel shape
FillOHollow
 Fill massive pipe steel shape
FillRectangle
 Rectangle shape - massive concrete shape
FillShapeDblL
 Creates a new L shape css
FillShapeDblLu
 Creates a new L shape css.
FillShapeDblU
 Creates a ][ steel shape of css.
FillShapeI
 I shape - massive concrete shape
FillShapeL
 Creates a new L shape css - massive concrete shape
FillShapeT
 T shape - massive concrete shape
FillShapeTrev
 T turned shape - massive concrete shape
FillShapeU
 Creates a U shape of css.
FillSteelTI
 Fill steel T profile made from part of I profile
FillSteelTube
 Fill steel tube
FillWelded2Lt
 Fill steel section Lt shape
FillWelded2Lu
 Fill steel section Lu shape
FillWelded2Uc
 Fill steel section Channel shape
FillWeldedAsymI
 Welded I asymetrical - steel shape
FillWeldedI
 Fill steel section of welded I
FillWeldedT
 Fill steel section of welded T
FillWeldedU
 Fill steel section of channel shape
Top
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace